from tabulate import tabulate
from task_2 import host_range_ping


def host_range_ping_tab():
    result = host_range_ping()
    print(tabulate(result, headers='keys', tablefmt='rounded_grid', stralign='center'))


if __name__ == '__main__':
    host_range_ping_tab()

"""
Введите ip-адрес: 77.88.55.88
Какое количество адресов проверить? 4
Узел 77.88.55.88 - доступен
Узел 77.88.55.89 - не доступен
Узел 77.88.55.90 - не доступен
Узел 77.88.55.91 - не доступен
╭─────────────┬───────────────╮
│  доступен   │  не доступен  │
├─────────────┼───────────────┤
│ 77.88.55.88 │  77.88.55.89  │
├─────────────┼───────────────┤
│             │  77.88.55.90  │
├─────────────┼───────────────┤
│             │  77.88.55.91  │
╰─────────────┴───────────────╯
"""